In [108]:
import pandas as pd
import matplotlib.pyplot as plt

# Verifica **A**

In [124]:
df = pd.read_excel('https://raw.githubusercontent.com/wtitze/3E/main/Medals.xlsx')
df

    Rank                    Team/NOC  Gold  ...  Bronze  Total  Rank by Total
0      1    United States of America    39  ...      33    113              1
1      2  People's Republic of China    38  ...      18     88              2
2      3                       Japan    27  ...      17     58              5
3      4               Great Britain    22  ...      22     65              4
4      5                         ROC    20  ...      23     71              3
..   ...                         ...   ...  ...     ...    ...            ...
88    86                       Ghana     0  ...       1      1             77
89    86                     Grenada     0  ...       1      1             77
90    86                      Kuwait     0  ...       1      1             77
91    86         Republic of Moldova     0  ...       1      1             77
92    86        Syrian Arab Republic     0  ...       1      1             77

[93 rows x 7 columns]

1\. Visualizzare il numero di medaglie d’oro vinte dall’Italia

In [110]:
df[df['Team/NOC'] == 'Italy']['Gold']

9    10
Name: Gold, dtype: int64

2\. Visualizzare il numero di medaglie d’oro delle nazioni che cominciano con la lettera F

In [111]:
df[df['Team/NOC'].str.startswith('F') == True]['Gold']

7     10
59     1
84     0
Name: Gold, dtype: int64

3\. Aggiungere una colonna contenente il numero totale di medaglie di ogni nazione. Chiamare la colonna “Total”

In [112]:
df['Total'] = df['Gold'] + df['Silver'] + df['Bronze']
df

    Rank                    Team/NOC  Gold  ...  Bronze  Total  Rank by Total
0      1    United States of America    39  ...      33    113              1
1      2  People's Republic of China    38  ...      18     88              2
2      3                       Japan    27  ...      17     58              5
3      4               Great Britain    22  ...      22     65              4
4      5                         ROC    20  ...      23     71              3
..   ...                         ...   ...  ...     ...    ...            ...
88    86                       Ghana     0  ...       1      1             77
89    86                     Grenada     0  ...       1      1             77
90    86                      Kuwait     0  ...       1      1             77
91    86         Republic of Moldova     0  ...       1      1             77
92    86        Syrian Arab Republic     0  ...       1      1             77

[93 rows x 7 columns]

4\. Visualizzare la nazione che ha vinto più medaglie (in totale)

In [113]:
df.sort_values('Total', ascending=False)['Team/NOC'][0]

'United States of America'

5\. Visualizzare il numero totale di medaglie vinte complessivamente da tutte le nazioni

In [114]:
df['Total'].sum()

1080

6\. Aggiungere una colonna contenente la percentuale di medaglie vinte da ogni nazione. Chiamare la colonna “Percentuale”

In [125]:
df['Percentuale'] = round(100 * df['Total']/df['Total'].sum(), 2)
df

    Rank                    Team/NOC  Gold  ...  Total  Rank by Total  Percentuale
0      1    United States of America    39  ...    113              1        10.46
1      2  People's Republic of China    38  ...     88              2         8.15
2      3                       Japan    27  ...     58              5         5.37
3      4               Great Britain    22  ...     65              4         6.02
4      5                         ROC    20  ...     71              3         6.57
..   ...                         ...   ...  ...    ...            ...          ...
88    86                       Ghana     0  ...      1             77         0.09
89    86                     Grenada     0  ...      1             77         0.09
90    86                      Kuwait     0  ...      1             77         0.09
91    86         Republic of Moldova     0  ...      1             77         0.09
92    86        Syrian Arab Republic     0  ...      1             77         0.09

[93 rows x 8 columns]



---

<hr>

In [116]:
df = pd.read_excel('https://raw.githubusercontent.com/wtitze/3E/main/Teams.xlsx')
df

              Name      Discipline                         NOC  Event
0          Belgium  3x3 Basketball                     Belgium    Men
1            China  3x3 Basketball  People's Republic of China    Men
2            China  3x3 Basketball  People's Republic of China  Women
3           France  3x3 Basketball                      France  Women
4            Italy  3x3 Basketball                       Italy  Women
..             ...             ...                         ...    ...
738   South Africa      Water Polo                South Africa  Women
739          Spain      Water Polo                       Spain    Men
740          Spain      Water Polo                       Spain  Women
741  United States      Water Polo    United States of America    Men
742  United States      Water Polo    United States of America  Women

[743 rows x 4 columns]

1\. Visualizzare il numero di squadre per ogni sesso

In [117]:
df['Event'].value_counts()

Men                                 120
Women                               114
Women's Team                         40
Men's Team                           40
Mixed Team                           29
Duet                                 22
Mixed Relay                          18
Women's 4 x 200m Freestyle Relay     17
Mixed Doubles                        16
Women's Madison                      16
Men's 4 x 100m Medley Relay          16
Women's 4 x 100m Relay               16
Mixed 4 x 100m Medley Relay          16
Men's 4 x 100m Relay                 16
Men's 4 x 100m Freestyle Relay       16
Women's 4 x 400m Relay               16
Women's 4 x 100m Freestyle Relay     16
Men's 4 x 200m Freestyle Relay       16
Men's Madison                        16
Men's 4 x 400m Relay                 16
Women's 4 x 100m Medley Relay        16
4 x 400m Relay Mixed                 15
Group All-Around                     14
Team                                 10
Men's Foil Team                       9
Women's Sabre Team                    9
Men's Sabre Team                      9
Men's Épée Team                       9
Women's Team Sprint                   8
Women's Épée Team                     8
Women's Team Pursuit                  8
Men's Team Sprint                     8
Men's Team Pursuit                    8
Women's Foil Team                     8
Softball                              6
Baseball                              6
Name: Event, dtype: int64

2\. Visualizzare il numero di discipline a cui ha partecipato ogni nazione. Ordinare in ordine decrescente a partire dalla nazione che ha presentato più squadre. Contare insieme squadre maschili e femminili

In [118]:
data = df.groupby('NOC', as_index=False).agg({'Event': 'count'}).sort_values('Event', ascending=False)
data

                         NOC  Event
42                     Japan     48
79  United States of America     47
40                     Italy     37
28                   Germany     36
2                  Australia     35
..                       ...    ...
46             Liechtenstein      1
48                  Malaysia      1
52                   Morocco      1
60               Puerto Rico      1
83                    Zambia      1

[84 rows x 2 columns]

3\. Visualizzare il numero di nazioni che hanno partecipato alle varie discipline. Ordinare in ordine decrescente in base alla disciplina che ha avuto più squadre partecipanti

In [119]:
data = df.groupby('Discipline', as_index=False).agg({'NOC': 'count'}).sort_values('NOC', ascending=False)
data

             Discipline  NOC
15             Swimming  113
4             Athletics   79
8         Cycling Track   64
1               Archery   53
9               Fencing   52
7      Beach Volleyball   48
16         Table Tennis   48
3     Artistic Swimming   32
10             Football   28
2   Artistic Gymnastics   24
18           Volleyball   24
6            Basketball   24
11             Handball   24
12               Hockey   24
14         Rugby Sevens   24
19           Water Polo   22
17            Triathlon   18
0        3x3 Basketball   16
13  Rhythmic Gymnastics   14
5     Baseball/Softball   12

4\. Visualizzare il nome della nazione che ha portato più squadre

In [120]:
df.groupby('NOC', as_index=False).agg({'Event': 'count'}).sort_values('Event', ascending=False).values[0][0]

'Japan'

5\. Eliminare la colonna “Event”

In [121]:
df = df.drop(columns=['Event'])

6\. Rinominare la colonna NOC in “Name”

In [122]:
df.rename(columns={"NOC": "Name"})

              Name      Discipline                        Name
0          Belgium  3x3 Basketball                     Belgium
1            China  3x3 Basketball  People's Republic of China
2            China  3x3 Basketball  People's Republic of China
3           France  3x3 Basketball                      France
4            Italy  3x3 Basketball                       Italy
..             ...             ...                         ...
738   South Africa      Water Polo                South Africa
739          Spain      Water Polo                       Spain
740          Spain      Water Polo                       Spain
741  United States      Water Polo    United States of America
742  United States      Water Polo    United States of America

[743 rows x 3 columns]

# Verifica **B**

In [136]:
df = pd.read_excel('https://raw.githubusercontent.com/wtitze/3E/main/EntriesGender.xlsx')
df

               Discipline  Female  Male  Total
0          3x3 Basketball      32    32     64
1                 Archery      64    64    128
2     Artistic Gymnastics      98    98    196
3       Artistic Swimming     105     0    105
4               Athletics     969  1072   2041
5               Badminton      86    87    173
6       Baseball/Softball      90   144    234
7              Basketball     144   144    288
8        Beach Volleyball      48    48     96
9                  Boxing     102   187    289
10           Canoe Slalom      41    41     82
11           Canoe Sprint     123   126    249
12  Cycling BMX Freestyle      10     9     19
13     Cycling BMX Racing      24    24     48
14  Cycling Mountain Bike      38    38     76
15           Cycling Road      70   131    201
16          Cycling Track      90    99    189
17                 Diving      72    71    143
18             Equestrian      73   125    198
19                Fencing     107   108    215
20               Football     264   344    608
21                   Golf      60    60    120
22               Handball     168   168    336
23                 Hockey     192   192    384
24                   Judo     192   201    393
25                 Karate      40    42     82
26      Marathon Swimming      25    25     50
27      Modern Pentathlon      36    36     72
28    Rhythmic Gymnastics      96     0     96
29                 Rowing     257   265    522
30           Rugby Sevens     146   151    297
31                Sailing     175   175    350
32               Shooting     178   178    356
33          Skateboarding      40    40     80
34         Sport Climbing      20    20     40
35                Surfing      20    20     40
36               Swimming     361   418    779
37           Table Tennis      86    86    172
38              Taekwondo      65    65    130
39                 Tennis      94    97    191
40  Trampoline Gymnastics      16    16     32
41              Triathlon      55    55    110
42             Volleyball     144   144    288
43             Water Polo     122   146    268
44          Weightlifting      98    99    197
45              Wrestling      96   193    289

1\. Visualizzare il numero di atleti maschi del nuoto

In [137]:
df[df['Discipline'] == 'Swimming']['Male']

36    418
Name: Male, dtype: int64

2\. Visualizzare le discipline con meno di 100 atleti donne

In [138]:
df[df['Female'] <= 100]['Discipline']

0            3x3 Basketball
1                   Archery
2       Artistic Gymnastics
5                 Badminton
6         Baseball/Softball
8          Beach Volleyball
10             Canoe Slalom
12    Cycling BMX Freestyle
13       Cycling BMX Racing
14    Cycling Mountain Bike
15             Cycling Road
16            Cycling Track
17                   Diving
18               Equestrian
21                     Golf
25                   Karate
26        Marathon Swimming
27        Modern Pentathlon
28      Rhythmic Gymnastics
33            Skateboarding
34           Sport Climbing
35                  Surfing
37             Table Tennis
38                Taekwondo
39                   Tennis
40    Trampoline Gymnastics
41                Triathlon
44            Weightlifting
45                Wrestling
Name: Discipline, dtype: object

3\. Aggiungere una colonna contenente il numero totale di atleti di ogni disciplina. Chiamare la colonna “Total”

In [139]:
df['Total'] = df['Female'] + df['Male']

4\. Visualizzare la nazione che ha più atleti (in totale)

5\. Visualizzare il numero totale di atleti

In [140]:
df['Total'].sum()

11316

6\. Aggiungere una colonna contenente la percentuale di atleti di ogni disciplina rispetto al totale. Chiamare la colonna “Percentuale”

In [141]:
df['Percentuale'] = round(100 * df['Total']/df['Total'].sum(), 2)

<hr>

In [142]:
df = pd.read_excel('https://raw.githubusercontent.com/wtitze/3E/main/Coaches.xlsx')
df

                       Name  ...  Event
0           ABDELMAGID Wael  ...    NaN
1                 ABE Junya  ...    NaN
2             ABE Katsuhiko  ...    NaN
3              ADAMA Cherif  ...    NaN
4                AGEBA Yuya  ...    NaN
..                      ...  ...    ...
389  ZAMORA PEDREIRA Javier  ...    NaN
390      ZAMPIERI Francesca  ...   Duet
391          ZHANG Xiaohuan  ...    NaN
392              ZIJP Simon  ...    NaN
393           ZONDI Nkuliso  ...  Women

[394 rows x 4 columns]

1\. Visualizzare il numero di allenatori per ogni nazione. Ordinare in ordine decrescente a partire dalla nazione che ha più allenatori.

In [143]:
data = df['NOC'].value_counts().sort_values(ascending=False)
data

Japan                       35
Spain                       28
United States of America    28
Australia                   22
Canada                      16
                            ..
Portugal                     1
Liechtenstein                1
Honduras                     1
Slovakia                     1
Tunisia                      1
Name: NOC, Length: 61, dtype: int64

2\. Visualizzare il numero di allenatori per ogni  disciplina. Ordinare in ordine decrescente in base alla disciplina in cui ci sono più allenatori

In [144]:
data = df['Discipline'].value_counts().sort_values(ascending=False)
data

Basketball           74
Artistic Swimming    69
Football             59
Volleyball           45
Hockey               45
Handball             29
Baseball/Softball    26
Rugby Sevens         25
Water Polo           22
Name: Discipline, dtype: int64

3\. Visualizzare il nome della nazione che ha portato più allenatori

In [145]:
df['NOC'].value_counts().sort_values(ascending=False).index[0]

'Japan'

4\. Visualizzare il nome delle nazioni che hanno portato più allenatori rispetto alla media

In [146]:
pd.Series(df['NOC'].value_counts()/df['NOC'].value_counts().sum() * 100).sort_values().index[0]

'Tunisia'

5\. Eliminare la colonna “Name”

In [147]:
df = df.drop(columns='Name')

6\. Rinominare la colonna NOC in “Name”

In [148]:
df.rename(columns={"NOC": "Name"})

                           Name         Discipline  Event
0                         Egypt           Football    NaN
1                         Japan         Volleyball    NaN
2                         Japan         Basketball    NaN
3                 Côte d'Ivoire           Football    NaN
4                         Japan         Volleyball    NaN
..                          ...                ...    ...
389                       Spain         Basketball    NaN
390               Liechtenstein  Artistic Swimming   Duet
391  People's Republic of China  Artistic Swimming    NaN
392                 Netherlands             Hockey    NaN
393                South Africa             Hockey  Women

[394 rows x 3 columns]